def norm(data):
    # Функция анализирует входные данные. Распознаёт все альтернативные форматы ввода чисел, приводит их к стандартам
    # записи чисел в Python и возвращает значение с типом данных, определенным внутри функции. Если функция получила
    # нечисловое значение, она возвращает то, что получила, то есть данные, в которых функция не распознала число, она
    # прожуёт и выплюнет без изменений.

    string = str(data).strip()# Объявляем переменную 'string' и присваиваем ей строковое значение параметра 'data',
    # исключая возможные пробелы как в начале, так и в конце строки. Функция принимает входные данные любого типа и
    # безопасно конвертирует их в строковый формат для последующей обработки. Этот подход предотвращает ошибки при
    # работе со строковыми методами и обеспечивает корректную обработку данных. Аргумент data остаётся неизменным
    # и будет возвращён функцией в качестве результата, если data не является числом.

    if not string: return data  # Если функция принимает пустую строку, она возвращает её и завершает работу.

    string = string.replace(',', '.')  # Заменяем запятые на точки в строке string для корректного
    # преобразования чисел с запятой в формат с точкой. Результат сохраняется в переменную string, которая
    # используется во всех последующих операциях функции.

    if string.startswith('-.') and len(string) > 2: string = '-0.' + string[2:]  # Исправляем возможные альтернативные
    if string.startswith('+.') and len(string) > 2: string = '0.' + string[2:]   # форматы ввода чисел с клавиатуры
    if string.startswith('.') and len(string) > 1: string = '0.' + string[1:]    # на математический стандарт Python.
    if string.endswith('.') and len(string) > 1: string = string[0:-1]  # Если функция получила строку с точкой в конце,
                                                                        # к примеру, '5.' - отсекаем точку.
    if string[0] == '-':  # Проверяем возможное отрицательное значение.
        sign = '-'  # Индикатор положительности или отрицательности числа.
        # Запоминаем знак перед числом, в этом случае возможное число - отрицательное.
        string = string[1:]  # Присваиваем переменной 'string' срез строки возможного
        # числа без знака минус из строки 'string'.
    elif string[0] == '+':  # Проверяем возможное акцентированное положительное значение.
        sign = ''  # Индикатор положительности или отрицательности числа.
        # Запоминаем знак перед числом, в этом случае возможное число - положительное.
        string = string[1:]  # Присваиваем переменной 'string' срез строки возможного
        # положительного числа без знака плюс из строки 'string'.
    else:  # Символ строки 'string' под индексом 0 не является минусом или плюсом.
        sign = ''  # индикатор положительности или отрицательности числа.

    if len(string.split('.')) == 1 and string.isdigit():  # Если при разделении строки string по точкам
        # получается один элемент, состоящий только из цифр, то к значению присоединяется знак sign
        # и результат преобразуется в целое число.
        string = int(sign + string)  # будет возвращено функцией в виде целого числа.
    elif len(string.split('.')) == 2 and string.split('.')[0].isdigit() and string.split('.')[1].isdigit():
        # При наличии двух цифровых элементов после разделения строки string по точкам, значение формируется путем
        # конкатенации знака sign и строки string.
        if int(string.split('.')[1]) == 0:  # Если второй элемент,
            # т.е. дробная часть вещественного числа равна нулю, то число - целое.
            # Преобразовываем в целое, не забывая про знак плюс или минус.
            string = int(sign + string.split('.')[0])  # будет возвращено функцией в виде целого числа.
        else:
            string = float(sign + string)  # Будет возвращено функцией в виде вещественного числа.

    if string == 0:  # приводит значение в нормальный вид, например,
        # если пользователь введёт '-0 или ',0'  или '-00,00'  и т.п.
        string = 0  # будет возвращено функцией в виде числа.

    if (type(string) == str):
        string = data # Во всех противных случаях, переданное значение не является числом.
        # Конечному значению переменной 'string' присваивается значение и тип, переданное в функцию параметром 'data'.

    return string  # функция возвращает либо число (целое или вещественное), либо значение, переданное в функцию.

# Разработчик - Климков Максим, +7 (916) 386-38-32.
