from isanlp_rst.parser import Parser


# Define the version of the model you want to use
# version = 'gumrrg'  # Choose from {'gumrrg', 'rstdt', 'rstreebank'}

# Initialize the parser with the desired version
parser = Parser(hf_model_name='tchewik/isanlp_rst_v3',
                hf_model_version='unirst',
                cuda_device=0,
                relinventory='rus.rst.rrg'
               )

text = """
Tesla научилась «шашковать» на трассе, этот режим автопилота получил название «Безумный Макс»
В этом месяце Tesla выпустила новое обновление прошивки, которое добавило пару новых режимов вождения для спорной функции полного самостоятельного вождения (FSD). Один из них, называемый «Ленивец», снижает ускорение и остается на своей полосе. Другой, называемый «Безумный Макс», делает обратное: он разгоняется и лавирует в потоке машин, чтобы быстрее доставить вас к месту назначения. И после многочисленных сообщений о том, что машины реально ведут себя так, Национальное управление безопасности дорожного движения (National Highway Traffic Safety Administration) решила взять этот момент на контроль.
На самом деле режим «Безумный Макс» не такой уж и новый: Tesla провела бета-тестирование аналогичной функции в системе автопилота в 2018 году, но после многочисленных жалоб решила не выпускать её в серийную версию.
NHTSA начало новое предварительное расследование в отношении Tesla после десятков жалоб на то, что ее электромобили проезжали знаки «Стоп» или выезжали на полосу встречного движения в условиях работы FSD.
«Tesla намеренно программирует автомобили так, чтобы они превышали скорость и вели себя агрессивно, подвергая риску всех участников дорожного движения. Этот выпуск в стиле «Безумного Макса» — очередная демонстрация того, что Tesla предпочитает эстетику и продажи безопасности. Я призываю регулирующие органы принять меры, чтобы не допустить распространения этой технологии», — заявил Бретт Шрайбер, партнёр-основатель фирмы, отсудивший у нее же сотни миллионов долларов.
Власти Мальдив решили радикально бороться с проблемой курения
На архипелаге в Индийском океане запрещено покупать или употреблять табак лицам, родившимся после 1 января 2007 года, в целях «воспитания поколения, свободного от табака».
Эта мера, инициированная президентом Мохамедом Муиззу в начале этого года и вступившая в силу 1 ноября, «защитит здоровье населения и будет способствовать формированию поколения, свободного от табачной зависимости», заявили в министерстве.
Эта мера также распространяется на посетителей страны, состоящей из 1191 крошечного кораллового островка, разбросанных примерно на 800 км (500 миль) по обе стороны от экватора и известных своим роскошным туризмом.
Министерство заявило, что также сохраняет всеобъемлющий запрет на импорт, продажу, распространение, хранение и использование электронных сигарет и вейпов, который распространяется на всех лиц независимо от возраста.
Продажа табачных изделий несовершеннолетним наказывается штрафом в размере 50 000 руфий (3200 долларов США), а использование вейпов — 5000 руфий (320 долларов США).
"""

# Parse the text to obtain the RST tree
res = parser(text)  # res['rst'] contains the binary discourse tree
print('UniRST parsed text successfully!')

res['rst'][0].to_rs3('tmp_e2e.rs3')

all_edus = [
    'Tesla научилась «шашковать» на трассе,',
    'этот режим автопилота получил название «Безумный Макс»',
    'В этом месяце Tesla выпустила новое обновление прошивки,',
    'которое добавило пару новых режимов вождения для спорной функции полного самостоятельного вождения',
    '(FSD).',
    'Один из них,',
    'называемый «Ленивец»,',
    'снижает ускорение и остается на своей полосе.',
    'Другой,',
    'называемый «Безумный Макс»,',
    'делает обратное:',
    'он разгоняется',
    'и лавирует в потоке машин,',
    'чтобы быстрее доставить вас к месту назначения.',
    'И после многочисленных сообщений о том,',
    'что машины реально ведут себя так,',
    'Национальное управление безопасности дорожного движения',
    '(National Highway Traffic Safety Administration)',
    'решила взять этот момент на контроль.',
    'На самом деле режим «Безумный Макс» не такой уж и новый:',
    'Tesla провела бета-тестирование аналогичной функции в системе автопилота в 2018 году,',
    'но после многочисленных жалоб решила не выпускать её в серийную версию.',
    'NHTSA начало новое предварительное расследование в отношении Tesla после десятков жалоб на то,',
    'что ее электромобили проезжали знаки «Стоп»',
    'или выезжали на полосу встречного движения',
    'в условиях работы FSD.',
    '«Tesla намеренно программирует автомобили так,',
    'чтобы они превышали скорость',
    'и вели себя агрессивно,',
    'подвергая риску всех участников дорожного движения.',
    'Этот выпуск в стиле «Безумного Макса» — очередная демонстрация того,',
    'что Tesla предпочитает эстетику и продажи безопасности.',
    'Я призываю регулирующие органы принять меры,',
    'чтобы не допустить распространения этой технологии»,',
    '— заявил Бретт Шрайбер, партнёр-основатель фирмы,',
    'отсудивший у нее же сотни миллионов долларов.',
    'Власти Мальдив решили радикально бороться с проблемой курения',
    'На архипелаге в Индийском океане запрещено покупать или употреблять табак лицам,',
    'родившимся после 1 января 2007 года,',
    'в целях «воспитания поколения, свободного от табака».',
    'Эта мера,',
    'инициированная президентом Мохамедом Муиззу в начале этого года',
    'и вступившая в силу 1 ноября,',
    '«защитит здоровье населения',
    'и будет способствовать формированию поколения,',
    'свободного от табачной зависимости»,',
    'заявили в министерстве.',
    'Эта мера также распространяется на посетителей страны,',
    'состоящей из 1191 крошечного кораллового островка,',
    'разбросанных примерно на 800 км',
    '(500 миль)',
    'по обе стороны от экватора',
    'и известных своим роскошным туризмом.',
    'Министерство заявило,',
    'что также сохраняет всеобъемлющий запрет на импорт, продажу, распространение, хранение и использование электронных сигарет и вейпов,',
    'который распространяется на всех лиц независимо от возраста.',
    'Продажа табачных изделий несовершеннолетним наказывается штрафом в размере 50 000 руфий',
    '(3200 долларов США),',
    'а использование вейпов — 5000 руфий',
    '(320 долларов США).'
]

res2 = parser.from_edus(all_edus)
print('UniRST parsed from edus successfully!')

res2['rst'][0].to_rs3('tmp.rs3')

