Repository: pypi-data/pypi-mirror-390
Catalog: packages/*-dynamicpages/*_dynamicpages-1.0.0b4-py3-none-any.whl/*_dynamicpages/locales/*/LC_MESSAGES/*_dynamicpages.po
Languages: es, eu

source: Add featured
es: Añadir elemento destacado
eu: Gehitu elementu destakatua

source: Add new row
es: Añadir fila
eu: Gehitu lerro berria

source: Add row
es: Añadir fila
eu: Gehitu lerroa

source: Are you sure you want to delete this item? This action cannot be undone.
es: ¿Estás seguro de que quieres eliminar este elemento? Esta acción no se puede deshacer.
eu: Ziur zaude elementu hau ezabatu nahi duzula? Ekintza hau ezin da desegin.

source: CSS class for the row width
es: Clase CSS para el ancho de la fila
eu: Lerroaren zabaleraren CSS klasea

source: CSS class for the spacer
es: Clase CSS para el espaciador
eu: Espazioa ematen duen elementuaren CSS klasea

source: Cancel
es: Cancelar
eu: Utzi

source: Close
es: Cerrar
eu: Itxi

source: Column count
es: Número de columnas
eu: Zutabe kopurua

source: Confirm Deletion
es: Confirmar eliminado
eu: Baieztatu ezabatzea

source: Delete
es: Eliminar
eu: Ezabatu

source: Dynamic Pages Control Panel
es: Panel de control de páginas dinámicas
eu: Orrialde dinamikoen kontrol panela

source: Dynamic view
es: Vista dinámica
eu: Bista dinamikoa

source: DynamicPageFolder
es: Carpeta de página dinámica
eu: Orri dinamikoen karpeta

source: DynamicPageRow
es: Fila de página dinámica
eu: Orri dinamikoen lerroa

source: DynamicPageRowFeatured
es: Destacado de fila de página dinámica
eu: Orri dinamikoen lerroetako destakatua

source: Edit
es: Editar
eu: Editatu

source: Edit Mode
es: Modo edición
eu: Edizio modua

source: Enter an extra CSS class that will be added to the row
es: Introduzca una clase CSS extra que se añadirá a la fila
eu: Idatzi lerroari gehituko zaion CSS klase gehigarria

source: Enter the URL of the link
es: Introduzca la URL del enlace
eu: Idatzi estekaren URLa

source: Enter the fields that will be available when editing this row type. This is useful to hide unused fields.
es: Introduzca los campos que se mostrarán al editar este tipo de fila. Esto es útil para esconder campos innecesarios.
eu: Idatzi lerro-mota hau editatzean agertuko diren eremuen izenak. Behar ez diren eremuak ezkutatzeko balio du honek.

source: Enter the text that will be linked
es: Introduzca el texto que será enlazado
eu: Idatzi esteka izango duen testua

source: Extra CSS class
es: Clase CSS extra
eu: CSS klase gehigarria

source: Fetch priority image
es: Atributo fetchpriority de la imagen
eu: Irudiaren 'fetchpriority' atributua

source: Has featured add button?
es: ¿Tiene el botón para añadir elementos destacados?
eu: Elementu destakatua gehitzeko botoia du?

source: Here we have all the available views for the rows and their settings
es: Aquí tenemos todas las vistas disponibles para las filas y su configuración
eu: Hemen lerro guztien bistak eta beren ezarpenak dituzu

source: Here you can define the available margins for each spacer
es: Aquí puede definir los márgenes disponibles
eu: Hemen espazioa ematen duen elementuaren marginak definitu ditzakezu

source: Here you can define the available paddings for each spacer
es: Aquí puede definir los padding disponibles
eu: Hemen espazioa ematen duen elementuaren paddingak definitu ditzakezu

source: Here you can define the available widths for each row
es: Aquí puede definir los anchos disponibles para las filas
eu: Hemen lerro bakoitzaren zabalera posibleak gehitu ditzakezu

source: Icon for the row type
es: Nombre de icono de la fila (utilizar nombres de iconos de bootstrap)
eu: Lerroaren ikonoa

source: If selected a 'Add featured' button will be added in the edit interface. This is useful for rows that have content pieces inside them. For example in a slider row, there are slider items. This button will be used to add those items.
es: Si está seleccionado se mostrará un botón "Añadir destacado" en la interfaz de edición. Esto es útil para filas que tiene elementos de contenido dentro de ellas. Por ejemplo en un slider de imágenes, cada una de las imágenes será un "destacado". Este botón se utiliza para añadir este tipo de elementos.
eu: Aukeratuta badago, edizio interfazean "Gehitu elementu destakatua" botoia agertuko da. Eduki elementuak dituzten lerroentzat da hau erabilgarria. Adibidez, karrusel bat adierazten duen lerro baten, elementu destakatua karruseleko elementuetako bakoitza izango da. Botoi hau elementu horiek gehitzeko erabiliko da.

source: Image position
es: Posición de la imagen
eu: Irudiaren posizioa

source: Left
es: Izquierda
eu: Ezkerrean

source: Link URL
es: URL del enlace
eu: Estekaren URLa

source: Link text
es: Texto del enlace
eu: Estekaren testua

source: Move actions
es: Acciones para mover elementos
eu: Elementuak mugitzeko akzioak

source: Move down
es: Bajar
eu: Mugitu behera

source: Move up
es: Subir
eu: Mugitu gora

source: Notification
es: Notificación
eu: Jakinarazpena

source: Package to configure a new cs_dynamicpages site
es: Paquete para configurar cs_dynamicpages
eu: cs_dynamicpages konfiguratzeko paketea

source: Related image
es: Imagen relacionada
eu: Irudi erlazionatua

source: Review state: ${state}
es: Estado: ${state}
eu: Egoera: ${state}

source: Right
es: Derecha
eu: Eskuma

source: Row Width CSS class
es: Clase CSS del ancho de la fila
eu: Lerroaren zabalerara CSS klasea

source: Row Width Label
es: Etiqueta del ancho de la fila
eu: Lerro zabaleraren etiketa

source: Row added successfully
es: Fila añadida correctamente
eu: Lerroa ondo gehitu da

source: Row fields
es: Campos de la fila
eu: Lerroaren eremuak

source: Row margin bottom
es: Margen inferior de la fila
eu: Lerroaren azpiko margina

source: Row margin top
es: Margen superior de la fila
eu: Lerroaren gaineko margina

source: Row padding bottom
es: Padding inferior de la fila
eu: Lerroaren beheko paddinga

source: Row padding top
es: Padding superior de la fila
eu: Lerroaren gaineko paddinga

source: Row type
es: Tipo de fila
eu: Lerro-mota

source: Row type field
es: Campo del tipo de fila
eu: Lerro motaren eremua

source: Row type fields
es: Campos del tipo de fila
eu: Lerro motaren eremuak

source: Row type icon
es: Icono de la fila
eu: Lerroaren ikonoa

source: Row width
es: Ancho de la fila
eu: Lerroaren zabalera

source: Row widths
es: Anchos de la fila
eu: Lerroaren zabalerak

source: Select how many columns will be shown in this row
es: Seleccione cuántas columnas se mostrarán en esta fila
eu: Aukeratu lerro honek zenbat zutabe izango dituen

source: Select the margin bottom that this row will have
es: Seleccione el margen inferior que tendrá esta fila
eu: Aukeratu lerro honen azpiko margina

source: Select the margin top that this row will have
es: Seleccione el margen superior que tendrá esta fila
eu: Aukeratu lerro honen gaineko margina

source: Select the padding bottom that this row will have
es: Seleccione el padding inferior que tendrá esta fila
eu: Aukeratu lerro honen azpiko paddinga

source: Select the padding top that this row will have
es: Seleccione el padding superior que tendrá esta fila
eu: Aukeratu lerro honen gaineko paddinga

source: Select the position of this image
es: Seleccione la posición de esta imagen
eu: Aukeratu irudiaren posizioa

source: Select the related image that will be shown in this row
es: Seleccione la imagen relaconada que se mostrará en esta fila
eu: Aukeratu lerro honetan agertuko den erlazionatutako irudia

source: Select the row type. This is the type of the row that will be added.
es: Seleccionar tipo de fila. Se añadira una fila de este tipo.
eu: Aukeratu lerro mota. Mota honetako lerroa gehituko da.

source: Select the width that this row will have
es: Seleccione el ancho de esta fila
eu: Aukeratu lerro honek izango duen zabalera

source: Set this to true if you want to signal that this image has a 'high' fetch priority, otherwise 'auto' will be used. When using 'high' the value of the loading attribute will be set to 'eager', and 'lazy' when it is not set.
es: Si está seleccionada, la imagen se mostrará con el atributo 'fetchpriority' puesto a 'high', y si no lo está como 'auto'. Del mismo modo, cuando esté a 'high' el atributo 'loading' se mostrará como 'eager' y 'lazy' de otro modo.
eu: Aukeratuta badago irudiaren 'fetchpriority' atributuaren balioa 'high' izango da, bestela 'auto'. 'high' erabiltzen denean, gainera, 'loading' atributuaren balioa 'eager' bezala erabiliko da, bestela 'lazy'.

source: Spacer CSS class
es: Clase CSS del espaciador
eu: Espazioa ematen duen elementuaren CSSa

source: Spacer Label
es: Etiqueta del espaciador
eu: Etiketa

source: Spacer margin bottom
es: Margen inferior
eu: Azpiko margina

source: Spacer margin top
es: Margen superior
eu: Gaineko margina

source: Spacer padding bottom
es: Padding inferior
eu: Azpiko paddinga

source: Spacer padding top
es: Padding superior
eu: Gaineko paddinga

source: State
es: Estado
eu: Egoera

source: Template: ${template_id}
es: Plantilla: ${template_id}
eu: Txantiloia: ${template_id}

source: This is the label corresponding to this spacer
es: Esta es la etiqueta que corresponde al espaciador
eu: Hau da espazio honen etiketa

source: This is the label corresponding to this width
es: Etiqueta correspondiente a este ancho
eu: Zabalera honi dagokion etiketa da hau

source: Uninstall cs_dynamicpages setup.
es: Desinstalar cs_dynamicpages.
eu: cs_dynamicpages desinstalatu.

source: cs_dynamicpages: Install
es: cs_dynamicpages: instalar
eu: cs_dynamicpages: instalatu

source: cs_dynamicpages: Uninstall
es: cs_dynamicpages: desinstalar
eu: cs_dynamicpages: desinstalatu
